; domain
;; PDDL Domain File: camouflage_equipment
(define (domain camouflage_equipment)
  (:requirements :strips :typing)
  (:types
    equipment rucksack helmet webbing weapon vehicle camouflage_net surface
  )

  (:predicates
    (laid_out ?e - equipment ?s - surface)               ; Equipment is laid out on a surface
    (organized ?e - equipment)                           ; Equipment is organized
    (camouflaged ?e - equipment)                         ; Equipment is camouflaged
    (carefully_disguised ?w - weapon)                    ; Weapon is carefully disguised
    (netted ?v - vehicle ?cn - camouflage_net)           ; Vehicle is netted with camouflage net
  )

  ;; Action 1: Lay out all equipment on a surface
  (:action lay_out_equipment
    :parameters (?e - equipment ?s - surface)
    :precondition (not (laid_out ?e ?s))
    :effect (laid_out ?e ?s)
  )

  ;; Action 2: Organize equipment
  (:action organize_equipment
    :parameters (?e - equipment ?s - surface)
    :precondition (and
      (laid_out ?e ?s)
      (not (organized ?e))
    )
    :effect (organized ?e)
  )
  (:action organize_rucksack
    :parameters (?e - equipment ?s - surface ?r - rucksack)
    :precondition (and
      (laid_out ?e ?s)
      (not (organized ?r))
    )
    :effect (organized ?r)
  )
  (:action organize_helmet
    :parameters (?e - equipment ?s - surface ?h - helmet)
    :precondition (and
      (laid_out ?e ?s)
      (not (organized ?h))
    )
    :effect (organized ?h)
  )
(:action organize_weapon
    :parameters (?e - equipment ?s - surface ?wep - weapon)
    :precondition (and
      (laid_out ?e ?s)
      (not (organized ?wep))
    )
    :effect (organized ?wep)
  )
  (:action organize_webbing
    :parameters (?e - equipment ?s - surface ?web - webbing)
    :precondition (and
      (laid_out ?e ?s)
      (not (organized ?web))
    )
    :effect (organized ?web)
  )
  ;; Action 3: Camouflage the rucksack
  (:action camouflage_rucksack
    :parameters (?r - rucksack)
    :precondition (and
      (organized ?r)
      (not (camouflaged ?r))
    )
    :effect (camouflaged ?r)
  )

  ;; Action 4: Camouflage the helmet
  (:action camouflage_helmet
    :parameters (?h - helmet)
    :precondition (and
      (organized ?h)
      (not (camouflaged ?h))
    )
    :effect (camouflaged ?h)
  )

  ;; Action 5: Camouflage the webbing
  (:action camouflage_webbing
    :parameters (?w - webbing)
    :precondition (and
      (organized ?w)
      (not (camouflaged ?w))
    )
    :effect (camouflaged ?w)
  )

  ;; Action 6: Carefully camouflage the weapon
  (:action camouflage_weapon
    :parameters (?wep - weapon)
    :precondition (and
      (organized ?wep)
      (not (camouflaged ?wep))
    )
    :effect (and
      (camouflaged ?wep)
      (carefully_disguised ?wep)
    )
  )

  ;; Action 7: Camouflage the vehicle with a camouflage net
  (:action camouflage_vehicle
    :parameters (?v - vehicle ?cn - camouflage_net)
    :precondition (not (netted ?v ?cn))
    :effect (netted ?v ?cn)
  )
)

; problem
;; PDDL Problem File: camouflage_task
(define (problem camouflage_task)
  (:domain camouflage_equipment)
  (:objects
    my_equipment - equipment
    my_rucksack - rucksack
    my_helmet - helmet
    my_webbing - webbing
    my_weapon - weapon
    my_vehicle - vehicle
    my_camouflage_net - camouflage_net
    ground_surface - surface
  )

  (:init
    ;; Initial state: Equipment exists but is not laid out, organized, or camouflaged
    (not (laid_out my_equipment ground_surface))
    (not (organized my_rucksack))
    (not (organized my_helmet))
    (not (organized my_webbing))
    (not (organized my_weapon))
    (not (camouflaged my_rucksack))
    (not (camouflaged my_helmet))
    (not (camouflaged my_webbing))
    (not (camouflaged my_weapon))
    (not (carefully_disguised my_weapon))
    (not (netted my_vehicle my_camouflage_net))
  )

  (:goal
    (and
      ;; All equipment is laid out on the ground surface
      (laid_out my_equipment ground_surface)

      ;; Equipment is organized
      (organized my_rucksack)
      (organized my_helmet)
      (organized my_webbing)
      (organized my_weapon)

      ;; Camouflage has been applied to all relevant equipment
      (camouflaged my_rucksack)
      (camouflaged my_helmet)
      (camouflaged my_webbing)
      (camouflaged my_weapon)
      (carefully_disguised my_weapon)

      ;; Vehicle has been camouflaged with the camouflage net
      (netted my_vehicle my_camouflage_net)
    )
  )
)

; plan
1. (lay_out_equipment my_equipment ground_surface)
   added: (laid_out my_equipment ground_surface)
   goals met: 1 of 11
2. (organize_webbing my_equipment ground_surface my_webbing)
   added: (organized my_webbing)
   goals met: 2 of 11
3. (organize_weapon my_equipment ground_surface my_weapon)
   added: (organized my_weapon)
   goals met: 3 of 11
4. (organize_rucksack my_equipment ground_surface my_rucksack)
   added: (organized my_rucksack)
   goals met: 4 of 11
5. (organize_helmet my_equipment ground_surface my_helmet)
   added: (organized my_helmet)
   goals met: 5 of 11
6. (camouflage_vehicle my_vehicle my_camouflage_net)
   added: (netted my_vehicle my_camouflage_net)
   goals met: 6 of 11
7. (camouflage_webbing my_webbing)
   added: (camouflaged my_webbing)
   goals met: 7 of 11
8. (camouflage_weapon my_weapon)
   added: (camouflaged my_weapon) (carefully_disguised my_weapon)
   goals met: 9 of 11
9. (camouflage_rucksack my_rucksack)
   added: (camouflaged my_rucksack)
   goals met: 10 of 11
10. (camouflage_helmet my_helmet)
   added: (camouflaged my_helmet)
   goals met: 11 of 11
